In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    'city': ['New York' , 'Lodon','Paris',"tokyo",'New York','Paris'],
    
    'price': [200,150,300,250,180,320]
})

In [5]:
df

       city  price
0  New York    200
1     Lodon    150
2     Paris    300
3     tokyo    250
4  New York    180
5     Paris    320

In [6]:
##price is target
##convert this categorical feature based on target

In [7]:
df.groupby('city')['price'].mean()

city
Lodon       150.0
New York    190.0
Paris       310.0
tokyo       250.0
Name: price, dtype: float64

In [9]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [10]:
mean_price

{'Lodon': 150.0, 'New York': 190.0, 'Paris': 310.0, 'tokyo': 250.0}

In [11]:
df['city_encoded'] = df['city'].map(mean_price)

In [12]:
df

       city  price  city_encoded
0  New York    200         190.0
1     Lodon    150         150.0
2     Paris    300         310.0
3     tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0

In [14]:
df[['price','city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0

Assignment

In [16]:
import pandas as pd
import seaborn as sns

In [18]:
df = sns.load_dataset('tips')

In [19]:
##time based on total bill

In [20]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [24]:
mean1 =df.groupby('time')['total_bill'].mean().to_dict()

C:\Users\Karthik\AppData\Local\Temp\ipykernel_16880\660202291.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean1 =df.groupby('time')['total_bill'].mean().to_dict()

In [25]:
mean1

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [27]:
df['time_encoded'] =df['time'].map(mean1)

In [28]:
df.head()

   total_bill   tip     sex smoker  day    time  size time_encoded
0       16.99  1.01  Female     No  Sun  Dinner     2    20.797159
1       10.34  1.66    Male     No  Sun  Dinner     3    20.797159
2       21.01  3.50    Male     No  Sun  Dinner     3    20.797159
3       23.68  3.31    Male     No  Sun  Dinner     2    20.797159
4       24.59  3.61  Female     No  Sun  Dinner     4    20.797159

In [29]:
df[['time_encoded','time']]

    time_encoded    time
0      20.797159  Dinner
1      20.797159  Dinner
2      20.797159  Dinner
3      20.797159  Dinner
4      20.797159  Dinner
..           ...     ...
239    20.797159  Dinner
240    20.797159  Dinner
241    20.797159  Dinner
242    20.797159  Dinner
243    20.797159  Dinner

[244 rows x 2 columns]